"""
4) Представлен список чисел. Определить элементы списка, не имеющие повторений.
Сформировать итоговый массив чисел, соответствующих требованию. Элементы вывести в
порядке их следования в исходном списке. Для выполнения задания обязательно
использовать генератор.
Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
Результат: [23, 1, 3, 10, 4, 11]
"""

default_list = [2, 2, 2, 4, 6, 7, 23, 1, 44, 44, 3, 2, 10, 10, 25, 7, 4, 11, 99, 11]
my_list = [el for el in default_list if default_list.count(el) == 1]

print(f"Список без повторов >>> {my_list}")
